zephyrproject-rtos/zephyr/drivers/clock_control/clock_stm32_ll_common.c
/*
 * Copyright (c) 2017-2022 Linaro Limited.
 * Copyright (c) 2017 RnDity Sp. z o.o.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <soc.h>
#include <stm32_bitops.h>
#include <stm32_ll_bus.h>
#include <stm32_ll_pwr.h>
#include <stm32_ll_rcc.h>
#include <stm32_ll_system.h>
#include <stm32_ll_utils.h>
#include <zephyr/arch/cpu.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/sys/util.h>
#include <zephyr/sys/__assert.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <stm32_backup_domain.h>
#include <stm32_hsem.h>

#include "clock_stm32_ll_common.h"

/*
 * Opt-in `st,flash-latency` on the flash controller node sets the
 * wait-state count directly (see the DT binding), bypassing the vendor
 * VOS-only LL_SetFlashLatency() helper. CONCAT()-ing the value onto
 * LL_FLASH_LATENCY_ resolves to the matching enum constant, or fails to
 * compile if that constant isn't defined for the target SoC -- each
 * part's own vendored header only defines the enum values its real
 * FLASH_ACR LATENCY field width can hold, so this is a free, per-part
 * bounds check with no separate table or assert needed.
 */
#if defined(CONFIG_SOC_SERIES_STM32F4X) && \
	DT_NODE_HAS_PROP(DT_INST(0, st_stm32_flash_controller), st_flash_latency)

#define STM32_FLASH_LATENCY_DT \
	CONCAT(LL_FLASH_LATENCY_, DT_PROP(DT_INST(0, st_stm32_flash_controller), st_flash_latency))

static inline void stm32_set_flash_latency(uint32_t freq)
{
	ARG_UNUSED(freq);
	LL_FLASH_SetLatency(STM32_FLASH_LATENCY_DT);
	while (LL_FLASH_GetLatency() != STM32_FLASH_LATENCY_DT) {
	}
}

#else /* !(CONFIG_SOC_SERIES_STM32F4X && st,flash-latency on the flash controller) */

static inline void stm32_set_flash_latency(uint32_t freq)
{
	LL_SetFlashLatency(freq);
}

#endif

/* Macros to fill up prescaler values */
#define hsi_divider(v) CONCAT(LL_RCC_HSI_DIV_, v)

#if defined(LL_RCC_HCLK_DIV_1)
#define ahb_prescaler(v) CONCAT(LL_RCC_HCLK_DIV_, v)
#else
#define ahb_prescaler(v) CONCAT(LL_RCC_SYSCLK_DIV_, v)
#endif

#define apb1_prescaler(v) CONCAT(LL_RCC_APB1_DIV_, v)

#if DT_NODE_HAS_PROP(DT_NODELABEL(rcc), apb2_prescaler)
#define apb2_prescaler(v) CONCAT(LL_RCC_APB2_DIV_, v)
#endif

#if DT_NODE_HAS_PROP(DT_NODELABEL(rcc), ahb4_prescaler)
#define RCC_CALC_FLASH_FREQ __LL_RCC_CALC_HCLK4_FREQ
#define GET_CURRENT_FLASH_PRESCALER LL_RCC_GetAHB4Prescaler
#elif DT_NODE_HAS_PROP(DT_NODELABEL(rcc), ahb3_prescaler)
#define RCC_CALC_FLASH_FREQ __LL_RCC_CALC_HCLK3_FREQ
#define GET_CURRENT_FLASH_PRESCALER LL_RCC_GetAHB3Prescaler
#else
#define RCC_CALC_FLASH_FREQ __LL_RCC_CALC_HCLK_FREQ
#define GET_CURRENT_FLASH_PRESCALER LL_RCC_GetAHBPrescaler
#endif

#if defined(RCC_PLLCFGR_PLLPEN)
#define RCC_PLLP_ENABLE() stm32_reg_set_bits(&RCC->PLLCFGR, RCC_PLLCFGR_PLLPEN)
#else
#define RCC_PLLP_ENABLE()
#endif /* RCC_PLLCFGR_PLLPEN */
#if defined(RCC_PLLCFGR_PLLQEN)
#define RCC_PLLQ_ENABLE() stm32_reg_set_bits(&RCC->PLLCFGR, RCC_PLLCFGR_PLLQEN)
#else
#define RCC_PLLQ_ENABLE()
#endif /* RCC_PLLCFGR_PLLQEN */

/**
 * @brief Return frequency for pll with 2 dividers and a multiplier
 */
__unused
static uint32_t get_pll_div_frequency(uint32_t pllsrc_freq,
				      int pllm_div,
				      int plln_mul,
				      int pllout_div)
{
	__ASSERT_NO_MSG(pllm_div && pllout_div);

	return pllsrc_freq / pllm_div * plln_mul / pllout_div;
}

static uint32_t get_bus_clock(uint32_t clock, uint32_t prescaler)
{
	return clock / prescaler;
}

__unused
static uint32_t get_msi_frequency(void)
{
#if defined(STM32_MSI_ENABLED)
#if !defined(LL_RCC_MSIRANGESEL_RUN)
	return __LL_RCC_CALC_MSI_FREQ(LL_RCC_MSI_GetRange());
#else
	return __LL_RCC_CALC_MSI_FREQ(LL_RCC_MSIRANGESEL_RUN,
				      LL_RCC_MSI_GetRange());
#endif
#endif
	return 0;
}

/** @brief Verifies clock is part of active clock configuration */
int enabled_clock(uint32_t src_clk)
{
	int r = 0;

	switch (src_clk) {
	case STM32_SRC_SYSCLK:
		break;
#if defined(STM32_SRC_PCLK)
	case STM32_SRC_PCLK:
		break;
#endif /* STM32_SRC_PCLK */
#if defined(STM32_SRC_HSE)
	case STM32_SRC_HSE:
		if (!IS_ENABLED(STM32_HSE_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_HSE */
#if defined(STM32_SRC_EXT_HSE)
	case STM32_SRC_EXT_HSE:
		/* EXT_HSE is the raw OSC_IN signal, so it is always
		 * available, regardless of the clocks configuration.
		 */
		break;
#endif /* STM32_SRC_HSE */
#if defined(STM32_SRC_HSI)
	case STM32_SRC_HSI:
		if (!IS_ENABLED(STM32_HSI_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_HSI */
#if defined(STM32_SRC_LSE)
	case STM32_SRC_LSE:
		if (!IS_ENABLED(STM32_LSE_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_LSE */
#if defined(STM32_SRC_LSI)
	case STM32_SRC_LSI:
		if (!IS_ENABLED(STM32_LSI_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_LSI */
#if defined(STM32_SRC_HSI14)
	case STM32_SRC_HSI14:
		if (!IS_ENABLED(STM32_HSI14_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_HSI14 */
#if defined(STM32_SRC_HSI48)
	case STM32_SRC_HSI48:
		if (!IS_ENABLED(STM32_HSI48_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_HSI48 */
#if defined(STM32_SRC_MSI)
	case STM32_SRC_MSI:
		if (!IS_ENABLED(STM32_MSI_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_MSI */
#if defined(STM32_SRC_CK48)
	case STM32_SRC_CK48:
		if (!IS_ENABLED(STM32_CK48_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_CK48 */
#if defined(STM32_SRC_PLLCLK)
	case STM32_SRC_PLLCLK:
		if (!IS_ENABLED(STM32_PLL_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLCLK */
#if defined(STM32_SRC_PLL_P)
	case STM32_SRC_PLL_P:
		if (!IS_ENABLED(STM32_PLL_P_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLL_P */
#if defined(STM32_SRC_PLL_Q)
	case STM32_SRC_PLL_Q:
		if (!IS_ENABLED(STM32_PLL_Q_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLL_Q */
#if defined(STM32_SRC_PLL_R)
	case STM32_SRC_PLL_R:
		if (!IS_ENABLED(STM32_PLL_R_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLL_R */
#if defined(STM32_SRC_PLL_POST_R)
	case STM32_SRC_PLL_POST_R:
		if (!IS_ENABLED(STM32_PLL_R_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLL_POST_R */
#if defined(STM32_SRC_PLLI2S_P)
	case STM32_SRC_PLLI2S_P:
		if (!IS_ENABLED(STM32_PLLI2S_P_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLI2S_P */
#if defined(STM32_SRC_PLLI2S_Q)
	case STM32_SRC_PLLI2S_Q:
		if (!IS_ENABLED(STM32_PLLI2S_Q_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLI2S_Q */
#if defined(STM32_SRC_PLLI2S_POST_Q)
	case STM32_SRC_PLLI2S_POST_Q:
		if (!IS_ENABLED(STM32_PLLI2S_Q_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLI2S_POST_Q */
#if defined(STM32_SRC_PLLI2S_R)
	case STM32_SRC_PLLI2S_R:
		if (!IS_ENABLED(STM32_PLLI2S_R_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLI2S_R */
#if defined(STM32_SRC_PLLI2S_POST_R)
	case STM32_SRC_PLLI2S_POST_R:
		if (!IS_ENABLED(STM32_PLLI2S_R_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLI2S_POST_R */
#if defined(STM32_SRC_PLLSAI_P)
	case STM32_SRC_PLLSAI_P:
		if (!IS_ENABLED(STM32_PLLSAI_P_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI_P */
#if defined(STM32_SRC_PLLSAI_Q)
	case STM32_SRC_PLLSAI_Q:
		if (!IS_ENABLED(STM32_PLLSAI_Q_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI_Q */
#if defined(STM32_SRC_PLLSAI_POST_Q)
	case STM32_SRC_PLLSAI_POST_Q:
		if (!IS_ENABLED(STM32_PLLSAI_Q_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI_POST_Q */
#if defined(STM32_SRC_PLLSAI_R)
	case STM32_SRC_PLLSAI_R:
		if (!IS_ENABLED(STM32_PLLSAI_R_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI_R */
#if defined(STM32_SRC_PLLSAI_POST_R)
	case STM32_SRC_PLLSAI_POST_R:
		if (!IS_ENABLED(STM32_PLLSAI_R_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI_POST_R */
#if defined(STM32_SRC_PLLSAI1_P)
	case STM32_SRC_PLLSAI1_P:
		if (!IS_ENABLED(STM32_PLLSAI1_P_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI1_P */
#if defined(STM32_SRC_PLLSAI1_Q)
	case STM32_SRC_PLLSAI1_Q:
		if (!IS_ENABLED(STM32_PLLSAI1_Q_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI1_Q */
#if defined(STM32_SRC_PLLSAI1_R)
	case STM32_SRC_PLLSAI1_R:
		if (!IS_ENABLED(STM32_PLLSAI1_R_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI1_R */
#if defined(STM32_SRC_PLLSAI2_P)
	case STM32_SRC_PLLSAI2_P:
		if (!IS_ENABLED(STM32_PLLSAI2_P_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI2_P */
#if defined(STM32_SRC_PLLSAI2_Q)
	case STM32_SRC_PLLSAI2_Q:
		if (!IS_ENABLED(STM32_PLLSAI2_Q_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI2_Q */
#if defined(STM32_SRC_PLLSAI2_R)
	case STM32_SRC_PLLSAI2_R:
		if (!IS_ENABLED(STM32_PLLSAI2_R_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI2_R */
#if defined(STM32_SRC_PLLSAI2_POST_R)
	case STM32_SRC_PLLSAI2_POST_R:
		if (!IS_ENABLED(STM32_PLLSAI2_R_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif /* STM32_SRC_PLLSAI2_POST_R */
#if defined(STM32_SRC_PLL2CLK)
	case STM32_SRC_PLL2CLK:
		if (!IS_ENABLED(STM32_PLL2_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif
#if defined(STM32_SRC_PLL3CLK)
	case STM32_SRC_PLL3CLK:
		if (!IS_ENABLED(STM32_PLL3_ENABLED)) {
			r = -ENOTSUP;
		}
		break;
#endif
#if defined(STM32_SRC_TIMPCLK1)
	case STM32_SRC_TIMPCLK1:
		break;
#endif /* STM32_SRC_TIMPCLK1 */
#if defined(STM32_SRC_TIMPCLK2)
	case STM32_SRC_TIMPCLK2:
		break;
#endif /* STM32_SRC_TIMPCLK2 */
#if defined(STM32_SRC_TIMPLLCLK)
	case STM32_SRC_TIMPLLCLK:
		break;
#endif /* STM32_SRC_TIMPLLCLK */
	default:
		return -ENOTSUP;
	}

	return r;
}

static int stm32_clock_control_configure(const struct device *dev,
					 clock_control_subsys_t sub_system, void *data);

static int stm32_clock_control_on(const struct device *dev, clock_control_subsys_t sub_system)
{
	struct stm32_pclken *pclken = (struct stm32_pclken *)(sub_system);
	volatile int temp;

	if (!IN_RANGE(pclken->bus, STM32_PERIPH_BUS_MIN, STM32_PERIPH_BUS_MAX)) {
		/* Source selection entry: apply it instead of toggling a gate */
		return stm32_clock_control_configure(dev, sub_system, NULL);
	}

	sys_set_bits(DT_REG_ADDR(DT_NODELABEL(rcc)) + pclken->bus,
		     pclken->enr);
	/* Delay after enabling the clock, to allow it to become active.
	 * See (for example) RM0440 7.2.17
	 */
	temp = sys_read32(DT_REG_ADDR(DT_NODELABEL(rcc)) + pclken->bus);
	UNUSED(temp);

