zephyrproject-rtos/zephyr/drivers/clock_control/clock_stm32_ll_common.c
	return 0;
}

static int stm32_clock_control_off(const struct device *dev, clock_control_subsys_t sub_system)
{
	struct stm32_pclken *pclken = (struct stm32_pclken *)(sub_system);

	ARG_UNUSED(dev);

	if (!IN_RANGE(pclken->bus, STM32_PERIPH_BUS_MIN, STM32_PERIPH_BUS_MAX)) {
		/* Attempt to toggle a wrong periph clock bit */
		return -ENOTSUP;
	}

	sys_clear_bits(DT_REG_ADDR(DT_NODELABEL(rcc)) + pclken->bus,
		       pclken->enr);

	return 0;
}

static int stm32_clock_control_configure(const struct device *dev,
					 clock_control_subsys_t sub_system,
					 void *data)
{
	/* At least one alt src clock available */
	struct stm32_pclken *pclken = (struct stm32_pclken *)(sub_system);
	uint32_t enr = pclken->enr;
	uint32_t reg = STM32_DT_CLKSEL_REG_GET(enr);
	uint32_t shift = STM32_DT_CLKSEL_SHIFT_GET(enr);
	int err;

	ARG_UNUSED(dev);
	ARG_UNUSED(data);

	err = enabled_clock(pclken->bus);
	if (err < 0) {
		/* Attempt to configure a src clock not available or not valid */
		return err;
	}

	if (pclken->enr == NO_SEL) {
		/* Domain clock is fixed. Nothing to set. Exit */
		return 0;
	}

	stm32_reg_modify_bits((uint32_t *)(DT_REG_ADDR(DT_NODELABEL(rcc)) + reg),
			      STM32_DT_CLKSEL_MASK_GET(enr) << shift,
			      STM32_DT_CLKSEL_VAL_GET(enr) << shift);

	return 0;
}

static int stm32_clock_control_get_subsys_rate(const struct device *clock,
						clock_control_subsys_t sub_system,
						uint32_t *rate)
{
	struct stm32_pclken *pclken = (struct stm32_pclken *)(sub_system);
	/*
	 * Get AHB Clock (= SystemCoreClock = SYSCLK/prescaler)
	 * SystemCoreClock is preferred to CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC
	 * since it will be updated after clock configuration and hence
	 * more likely to contain actual clock speed
	 */
	uint32_t ahb_clock = SystemCoreClock;
	uint32_t apb1_clock = get_bus_clock(ahb_clock, STM32_APB1_PRESCALER);
#if DT_NODE_HAS_PROP(DT_NODELABEL(rcc), apb2_prescaler)
	uint32_t apb2_clock = get_bus_clock(ahb_clock, STM32_APB2_PRESCALER);
#elif defined(STM32_CLOCK_BUS_APB2)
	/* APB2 bus exists, but w/o dedicated prescaler */
	uint32_t apb2_clock = apb1_clock;
#endif
#if DT_NODE_HAS_PROP(DT_NODELABEL(rcc), ahb3_prescaler)
	uint32_t ahb3_clock = get_bus_clock(ahb_clock * STM32_CPU1_PRESCALER,
					    STM32_AHB3_PRESCALER);
#elif defined(STM32_CLOCK_BUS_AHB3)
	/* AHB3 bus exists, but w/o dedicated prescaler */
	uint32_t ahb3_clock = ahb_clock;
#endif

	ARG_UNUSED(clock);

	switch (pclken->bus) {
	case STM32_CLOCK_BUS_AHB1:
#if defined(STM32_CLOCK_BUS_AHB2)
	case STM32_CLOCK_BUS_AHB2:
#endif
#if defined(STM32_CLOCK_BUS_IOP)
	case STM32_CLOCK_BUS_IOP:
#endif
		*rate = ahb_clock;
		break;
#if defined(STM32_CLOCK_BUS_AHB3)
	case STM32_CLOCK_BUS_AHB3:
		*rate = ahb3_clock;
		break;
#endif
	case STM32_CLOCK_BUS_APB1:
#if defined(STM32_CLOCK_BUS_APB1_2)
	case STM32_CLOCK_BUS_APB1_2:
#endif
#if defined(STM32_SRC_PCLK)
	case STM32_SRC_PCLK:
#endif
		*rate = apb1_clock;
		break;
#if defined(STM32_CLOCK_BUS_APB2)
	case STM32_CLOCK_BUS_APB2:
		*rate = apb2_clock;
		break;
#endif
#if defined(STM32_CLOCK_BUS_APB3)
	case STM32_CLOCK_BUS_APB3:
		/* STM32WL: AHB3 and APB3 share the same clock and prescaler. */
		*rate = ahb3_clock;
		break;
#endif
	case STM32_SRC_SYSCLK:
		*rate = SystemCoreClock * STM32_CORE_PRESCALER;
		break;
#if defined(STM32_SRC_PLLCLK) && defined(STM32_SYSCLK_SRC_PLL)
	case STM32_SRC_PLLCLK:
		if (get_pllout_frequency() == 0) {
			return -EIO;
		}
		*rate = get_pllout_frequency();
		break;
#endif
#if defined(STM32_SRC_PLL_P) && STM32_PLL_P_ENABLED
	case STM32_SRC_PLL_P:
		*rate = get_pll_div_frequency(get_pllsrc_frequency(),
					      STM32_PLL_M_DIVISOR,
					      STM32_PLL_N_MULTIPLIER,
					      STM32_PLL_P_DIVISOR);
		break;
#endif
#if defined(STM32_SRC_PLL_Q) && STM32_PLL_Q_ENABLED
	case STM32_SRC_PLL_Q:
		*rate = get_pll_div_frequency(get_pllsrc_frequency(),
					      STM32_PLL_M_DIVISOR,
					      STM32_PLL_N_MULTIPLIER,
					      STM32_PLL_Q_DIVISOR);
		break;
#endif
#if defined(STM32_SRC_PLL_R) && STM32_PLL_R_ENABLED
	case STM32_SRC_PLL_R:
		*rate = get_pll_div_frequency(get_pllsrc_frequency(),
					      STM32_PLL_M_DIVISOR,
					      STM32_PLL_N_MULTIPLIER,
					      STM32_PLL_R_DIVISOR);
		break;
#endif
#if defined(STM32_SRC_PLL_POST_R) && STM32_PLL_R_ENABLED && STM32_PLL_POST_R_ENABLED
	case STM32_SRC_PLL_POST_R:
		*rate = get_pll_div_frequency(get_pllsrc_frequency(),
					      STM32_PLL_M_DIVISOR,
					      STM32_PLL_N_MULTIPLIER,
					      STM32_PLL_R_DIVISOR);
		*rate /= STM32_PLL_POST_R_DIVISOR;
		break;
#endif
#if defined(STM32_SRC_PLLI2S_P) && STM32_PLLI2S_P_ENABLED
	case STM32_SRC_PLLI2S_P:
		*rate = get_pll_div_frequency(get_plli2ssrc_frequency(),
					      STM32_PLLI2S_M_DIVISOR,
					      STM32_PLLI2S_N_MULTIPLIER,
					      STM32_PLLI2S_P_DIVISOR);
		break;
#endif /* STM32_SRC_PLLI2S_P */
#if defined(STM32_SRC_PLLI2S_Q) && STM32_PLLI2S_Q_ENABLED
	case STM32_SRC_PLLI2S_Q:
		*rate = get_pll_div_frequency(get_plli2ssrc_frequency(),
					      STM32_PLLI2S_M_DIVISOR,
					      STM32_PLLI2S_N_MULTIPLIER,
					      STM32_PLLI2S_Q_DIVISOR);
		break;
#endif /* STM32_SRC_PLLI2S_Q */
#if defined(STM32_SRC_PLLI2S_POST_Q) && STM32_PLLI2S_Q_ENABLED && STM32_PLLI2S_POST_Q_ENABLED
	case STM32_SRC_PLLI2S_POST_Q:
		*rate = get_pll_div_frequency(get_plli2ssrc_frequency(),
					      STM32_PLLI2S_M_DIVISOR,
					      STM32_PLLI2S_N_MULTIPLIER,
					      STM32_PLLI2S_Q_DIVISOR);
		*rate /= STM32_PLLI2S_POST_Q_DIVISOR;
		break;
#endif /* STM32_SRC_PLLI2S_POST_Q */
#if defined(STM32_SRC_PLLI2S_R) && STM32_PLLI2S_R_ENABLED
	case STM32_SRC_PLLI2S_R:
		*rate = get_pll_div_frequency(get_plli2ssrc_frequency(),
					      STM32_PLLI2S_M_DIVISOR,
					      STM32_PLLI2S_N_MULTIPLIER,
					      STM32_PLLI2S_R_DIVISOR);
		break;
#endif /* STM32_SRC_PLLI2S_R */
#if defined(STM32_SRC_PLLI2S_POST_R) && STM32_PLLI2S_R_ENABLED && STM32_PLLI2S_POST_R_ENABLED
	case STM32_SRC_PLLI2S_POST_R:
		*rate = get_pll_div_frequency(get_plli2ssrc_frequency(),
					      STM32_PLLI2S_M_DIVISOR,
					      STM32_PLLI2S_N_MULTIPLIER,
					      STM32_PLLI2S_R_DIVISOR);
		*rate /= STM32_PLLI2S_POST_R_DIVISOR;
		break;
#endif /* STM32_SRC_PLLI2S_POST_R */
#if defined(STM32_SRC_PLLSAI_P) && STM32_PLLSAI_P_ENABLED
	case STM32_SRC_PLLSAI_P:
		*rate = get_pll_div_frequency(get_pllsaisrc_frequency(),
					      STM32_PLLSAI_M_DIVISOR,
					      STM32_PLLSAI_N_MULTIPLIER,
					      STM32_PLLSAI_P_DIVISOR);
		break;
#endif /* STM32_SRC_PLLSAI_P */
#if defined(STM32_SRC_PLLSAI_Q) && STM32_PLLSAI_Q_ENABLED
	case STM32_SRC_PLLSAI_Q:
		*rate = get_pll_div_frequency(get_pllsaisrc_frequency(),
					      STM32_PLLSAI_M_DIVISOR,
					      STM32_PLLSAI_N_MULTIPLIER,
					      STM32_PLLSAI_Q_DIVISOR);
		break;
#endif /* STM32_SRC_PLLSAI_Q */
#if defined(STM32_SRC_PLLSAI_POST_Q) && STM32_PLLSAI_Q_ENABLED && STM32_PLLSAI_POST_Q_ENABLED
	case STM32_SRC_PLLSAI_POST_Q:
		*rate = get_pll_div_frequency(get_pllsaisrc_frequency(),
					      STM32_PLLSAI_M_DIVISOR,
					      STM32_PLLSAI_N_MULTIPLIER,
					      STM32_PLLSAI_Q_DIVISOR);
		*rate /= STM32_PLLSAI_POST_Q_DIVISOR;
		break;
#endif /* STM32_SRC_PLLSAI_POST_Q */
#if defined(STM32_SRC_PLLSAI_R) && STM32_PLLSAI_R_ENABLED
	case STM32_SRC_PLLSAI_R:
		*rate = get_pll_div_frequency(get_pllsaisrc_frequency(),
					      STM32_PLLSAI_M_DIVISOR,
					      STM32_PLLSAI_N_MULTIPLIER,
					      STM32_PLLSAI_R_DIVISOR);
		break;
#endif /* STM32_SRC_PLLSAI_R */
#if defined(STM32_SRC_PLLSAI_POST_R) && STM32_PLLSAI_R_ENABLED && STM32_PLLSAI_POST_R_ENABLED
	case STM32_SRC_PLLSAI_POST_R:
		*rate = get_pll_div_frequency(get_pllsaisrc_frequency(),
					      STM32_PLLSAI_M_DIVISOR,
					      STM32_PLLSAI_N_MULTIPLIER,
					      STM32_PLLSAI_R_DIVISOR);
		*rate /= STM32_PLLSAI_POST_R_DIVISOR;
		break;
#endif /* STM32_SRC_PLLSAI_POST_R */
#if defined(STM32_SRC_PLLSAI1_P) && STM32_PLLSAI1_P_ENABLED
	case STM32_SRC_PLLSAI1_P:
		*rate = get_pll_div_frequency(get_pllsai1src_frequency(),
					      STM32_PLLSAI1_M_DIVISOR,
					      STM32_PLLSAI1_N_MULTIPLIER,
					      STM32_PLLSAI1_P_DIVISOR);
		break;
#endif /* STM32_SRC_PLLSAI1_P */
#if defined(STM32_SRC_PLLSAI1_Q) && STM32_PLLSAI1_Q_ENABLED
	case STM32_SRC_PLLSAI1_Q:
		*rate = get_pll_div_frequency(get_pllsai1src_frequency(),
					      STM32_PLLSAI1_M_DIVISOR,
					      STM32_PLLSAI1_N_MULTIPLIER,
					      STM32_PLLSAI1_Q_DIVISOR);
		break;
#endif /* STM32_SRC_PLLSAI1_Q */
#if defined(STM32_SRC_PLLSAI1_R) && STM32_PLLSAI1_R_ENABLED
	case STM32_SRC_PLLSAI1_R:
		*rate = get_pll_div_frequency(get_pllsai1src_frequency(),
					      STM32_PLLSAI1_M_DIVISOR,
					      STM32_PLLSAI1_N_MULTIPLIER,
					      STM32_PLLSAI1_R_DIVISOR);
		break;
#endif /* STM32_SRC_PLLSAI1_R */
#if defined(STM32_SRC_PLLSAI2_P) && STM32_PLLSAI2_P_ENABLED
	case STM32_SRC_PLLSAI2_P:
		*rate = get_pll_div_frequency(get_pllsai2src_frequency(),
					      STM32_PLLSAI2_M_DIVISOR,
					      STM32_PLLSAI2_N_MULTIPLIER,
					      STM32_PLLSAI2_P_DIVISOR);
		break;
#endif /* STM32_SRC_PLLSAI2_P */
#if defined(STM32_SRC_PLLSAI2_Q) && STM32_PLLSAI2_Q_ENABLED
	case STM32_SRC_PLLSAI2_Q:
		*rate = get_pll_div_frequency(get_pllsai2src_frequency(),
					      STM32_PLLSAI2_M_DIVISOR,
					      STM32_PLLSAI2_N_MULTIPLIER,
					      STM32_PLLSAI2_Q_DIVISOR);
		break;
#endif /* STM32_SRC_PLLSAI2_Q */
#if defined(STM32_SRC_PLLSAI2_R) && STM32_PLLSAI2_R_ENABLED
	case STM32_SRC_PLLSAI2_R:
		*rate = get_pll_div_frequency(get_pllsai2src_frequency(),
					      STM32_PLLSAI2_M_DIVISOR,
					      STM32_PLLSAI2_N_MULTIPLIER,
					      STM32_PLLSAI2_R_DIVISOR);
		break;
#endif /* STM32_SRC_PLLSAI2_R */
#if defined(STM32_SRC_PLLSAI2_POST_R) && STM32_PLLSAI2_R_ENABLED && STM32_PLLSAI2_POST_R_ENABLED
	case STM32_SRC_PLLSAI2_POST_R:
		*rate = get_pll_div_frequency(get_pllsai2src_frequency(),
					      STM32_PLLSAI2_M_DIVISOR,
					      STM32_PLLSAI2_N_MULTIPLIER,
					      STM32_PLLSAI2_R_DIVISOR);
		*rate /= STM32_PLLSAI2_POST_R_DIVISOR;
		break;
#endif /* STM32_SRC_PLLSAI2_POST_R */
#if defined(STM32_SRC_LSE)
	case STM32_SRC_LSE:
		*rate = STM32_LSE_FREQ;
		break;
#endif
#if defined(STM32_SRC_LSI)
	case STM32_SRC_LSI:
		*rate = STM32_LSI_FREQ;
		break;
#endif
#if defined(STM32_SRC_HSI)
	case STM32_SRC_HSI:
#if defined(CONFIG_SOC_SERIES_STM32L0X)
		*rate = STM32_HSI_FREQ / STM32_HSI_DIVISOR;
#else
		*rate = STM32_HSI_FREQ;
#endif
		break;
#endif
#if defined(STM32_SRC_MSI)
	case STM32_SRC_MSI:
		*rate = get_msi_frequency();
		break;
#endif
#if defined(STM32_SRC_HSE)
	case STM32_SRC_HSE:
		*rate = STM32_HSE_FREQ;
		break;
#endif
#if defined(STM32_HSI48_ENABLED)
	case STM32_SRC_HSI48:
		*rate = STM32_HSI48_FREQ;
		break;
#endif /* STM32_HSI48_ENABLED */
#if defined(STM32_CK48_ENABLED)
	case STM32_SRC_CK48:
		*rate = get_ck48_frequency();
		break;
#endif /* STM32_CK48_ENABLED */
#if defined(STM32_SRC_TIMPCLK1)
	case STM32_SRC_TIMPCLK1:
#if STM32_TIMER_PRESCALER && (defined(RCC_DCKCFGR_TIMPRE) || defined(RCC_DCKCFGR1_TIMPRE))
		*rate = STM32_APB1_PRESCALER <= 4 ? ahb_clock : apb1_clock * 4;
#else /* STM32_TIMER_PRESCALER && (RCC_DCKCFGR_TIMPRE || RCC_DCKCFGR1_TIMPRE) */
		*rate = STM32_APB1_PRESCALER <= 2 ? ahb_clock : apb1_clock * 2;
#endif /* STM32_TIMER_PRESCALER && (RCC_DCKCFGR_TIMPRE || RCC_DCKCFGR1_TIMPRE) */
		break;
#endif /* STM32_SRC_TIMPCLK1 */
#if defined(STM32_SRC_TIMPCLK2)
	case STM32_SRC_TIMPCLK2:
#if STM32_TIMER_PRESCALER && (defined(RCC_DCKCFGR_TIMPRE) || defined(RCC_DCKCFGR1_TIMPRE))
		*rate = STM32_APB2_PRESCALER <= 4 ? ahb_clock : apb2_clock * 4;
#else /* STM32_TIMER_PRESCALER && (RCC_DCKCFGR_TIMPRE || RCC_DCKCFGR1_TIMPRE) */
		*rate = STM32_APB2_PRESCALER <= 2 ? ahb_clock : apb2_clock * 2;
#endif /* STM32_TIMER_PRESCALER && (RCC_DCKCFGR_TIMPRE || RCC_DCKCFGR1_TIMPRE) */
		break;
#endif /* STM32_SRC_TIMPCLK2 */
#if defined(STM32_SRC_TIMPLLCLK) && DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(pll))
	case STM32_SRC_TIMPLLCLK:
		*rate = get_pllout_frequency() * 2;
		if (*rate == 0) {
			return -EIO;
		}
		break;
#endif /* STM32_SRC_TIMPLLCLK */

	default:
		return -ENOTSUP;
	}

	if (pclken->div) {
		*rate /= (pclken->div + 1);
	}

